const {styleNum} = require('../tools')
module.exports = {
  name: 'شناتي',
  rank: 0,
  description: "يقوم بحساب نسبة قبحك",
  cooldown: 0,
  run: async (api, event) => {
    const data = [
      "أنت 1٪ شين  🥺", "أنت 2٪ شين  🥺", "أنت 3٪ شين  🥺", "أنت 4٪ شين  🥺",
      "أنت 5٪ شين  🥺", "أنت 6٪ شين  🥺", "أنت 7٪ شين  🥺", "أنت 8٪ شين  🥺",
      "أنت 9٪ شين  🥺", "أنت 10٪ شين  🥺", "أنت 11٪ شين  🥺", "أنت 12٪ شين  🥺",
      "أنت 13٪ شين  🥺", "أنت 14٪ شين  🥺", "أنت 15٪ شين  🥺", "أنت 16٪ شين  🥺",
      "أنت 17٪ شين  🥺", "أنت 18٪ شين  🥺", "أنت 19٪ شين  🥺", "أنت 20٪ شين  🥺",
      "أنت 21٪ شين  🥺", "أنت 22٪ شين  🥺", "أنت 23٪ شين  🥺", "أنت 24٪ شين  🥺",
      "أنت 25٪ شين  🥺", "أنت 26٪ شين  🥺", "أنت 27٪ شين  🥺", "أنت 28٪ شين  🥺",
      "أنت 29٪ شين  🥺", "أنت 30٪ شين  🥺", "أنت 31٪ شين  🥺", "أنت 32٪ شين  🥺",
      "أنت 33٪ شين  🥺", "أنت 34٪ شين  🥺", "أنت 35٪ شين  🥺", "أنت 36٪ شين  🥺",
      "أنت 37٪ شين  🥺", "أنت 38٪ شين  🥺", "أنت 39٪ شين  🥺", "أنت 40٪ شين  🥺",
      "أنت 41٪ شين  🥺", "أنت 42٪ شين  🥺", "أنت 43٪ شين  🥺", "أنت 44٪ شين  🥺",
      "أنت 45٪ شين  🥺", "أنت 46٪ شين  🥺", "أنت 47٪ شين  🥺", "أنت 48٪ شين  🥺",
      "أنت 49٪ شين  🥺", "أنت 50٪ شين  🥺", "أنت 51٪ شين  🥺", "أنت 52٪ شين  🥺",
      "أنت 53٪ شين  🥺", "أنت 54٪ شين  🥺", "أنت 55٪ شين  🥺", "أنت 56٪ شين  🥺",
      "أنت 57٪ شين  🥺", "أنت 58٪ شين  🥺", "أنت 59٪ شين  🥺", "أنت 60٪ شين  🥺",
      "أنت 61٪ شين  🥺", "أنت 62٪ شين  🥺", "أنت 63٪ شين  🥺", "أنت 64٪ شين  🥺",
      "أنت 65٪ شين  🥺", "أنت 66٪ شين  🥺", "أنت 67٪ شين  🥺", "أنت 68٪ شين  🥺",
      "أنت 69٪ شين  🥺", "أنت 70٪ شين  🥺", "أنت 71٪ شين  🥺", "أنت 72٪ شين  🥺",
      "أنت 73٪ شين  🥺", "أنت 74٪ شين  🥺", "أنت 75٪ شين  🥺", "أنت 76٪ شين  🥺",
      "أنت 77٪ شين  🥺", "أنت 78٪ شين  🥺", "أنت 79٪ شين  🥺", "أنت 80٪ شين  🥺",
      "أنت 81٪ شين  🥺", "أنت 82٪ شين  🥺", "أنت 83٪ شين  🥺", "أنت 84٪ شين  🥺",
      "أنت 85٪ شين  🥺", "أنت 86٪ شين  🥺", "أنت 87٪ شين  🥺", "أنت 88٪ شين  🥺",
      "أنت 89٪ شين  🥺", "أنت 90٪ شين  🥺", "أنت 91٪ شين  🥺", "أنت 92٪ شين  🥺",
      "أنت 93٪ شين  🥺", "أنت 94٪ شين  🥺", "أنت 95٪ شين  🥺", "أنت 96٪ شين  🥺",
      "أنت 97٪ شين  🥺", "أنت 98٪ شين  🥺", "أنت 99٪ شين  🥺", "أنت 100٪ شين  🥺"
    ];
    let endMessage = data[Math.floor(Math.random() * data.length)]
     api.sendMessage(styleNum(endMessage), event.threadID, event.messageID);
  }
};
