module.exports = {
  name: "صراحة",
  otherName: ['صراحه'],
  rank: 0,
  cooldown: 0,
  run: async (api, event) => {
    const { threadID, messageID } = event;
    
    var tl = [
      'ما أسوأ شيء فعلته في الحياة؟',
      'حصل اتحرشو بيك ؟',
      'اسم امك منو ؟',
      'ما آخر قرار أخذته وندمت عليه؟',
      'ما أكثر شيء تكرهه في نفسك؟',
      'هل ظلمت أحد من قبل؟ كيف؟',
      'كيف ولماذا تركك الحبيب؟',
      'هل أحببت من طرف واحد من قبل؟',
      'هل غدر بك أعز صديق لك؟ كيف؟',
      'هل يمكنكِ الخروج دون وضع مكياج؟',
      'ما هو الشيء الذي يمثل لك خط أحمر؟',
      'ما هي الأفكار الجنونية التي تراودك؟',
      'من أول حب في حياتك؟ وما هي نهاية هذه القصة؟',
      'من أقرب شخص لك في هذه المجموعة ؟',
      'كم عدد تجاربك العاطفية؟',
      'هل يتواجد شخصًا تحبه في هذه المجموعة؟',
      'حبيت كم مرة ؟',
      'أوصف حياتك في كلمة؟',
      'هل لا تستطيع النوم بسبب شخص أو ذكريات؟',
      'هل حاولت الانتحار من قبل؟ لماذا؟',
      'غنيت كوتي شطور كم مرة ؟',
      'ما الشيء الذي تخاف منه؟',
      'هل يتواجد شخص تود أن تراه يبكي أمامك؟ من؟',
      'هل ظللت سنوات تحب شخص تركك؟',
      'راضي عن شخصيتك ؟',
      'هل هُناك موقف كلما تذكرته تبكي بشدة؟',
      'هل ساعدت أحد من قبل، وبعد ذلك شعرت بالندم لأنه لا يستحق؟',
      'حدد لنا درجة حبك لنفسك من 1 إلى 10',
      'هل من الممكن أن تقبلي أن تكوني زوجة ثانية؟',
      'ماذا ستفعلين إذا منعتِ من وضع المكياج طوال حياتكِ؟',
      'هل شعرت أن قلبك يؤلمك حقًا بسبب أحدهم؟',
      'إذا لم يكن هُناك قانون أو حلال وحرام، ما الأشياء التي سترغب في فعلها؟',
      'قيم جمالك من 10',
      'إذا كانت هُناك إمكانية للرجوع إلى الماضي وتغيير شيء ما، ماذا سيكون؟',
      'صفات شريك حياتك',
      'kiss or slap?',
      'الكره العظيم دائماً بيجي بعد حُب قوي " تتفق؟',
      'بتعمل شنو وقت تزعل ؟',
      'ترجع ل ex ?',
      'موقف محرج حصل معاك',
      'لابس شنو',
      'لونك المفضل'
      
    ];
    
    var tle = tl[Math.floor(Math.random() * tl.length)];
    var lon = `⊳${tle}.`;
    return api.sendMessage(lon, event.threadID, event.messageID);
  }
  
};
